namespace Assets.Scripts.Models
{
    internal class MarkerDataSharedDescription
    {
        public MarkerDataSharedDescription()
        {

        }

        public string main_corp =
            " Главный корпус оружейного завода – это уникальное произведение промышленной архитектуры России начала 19 века. " +
            "Оно имело ведущую градостроительную роль в нашем городе. Выполнено в стиле высокого классицизма и относится к редкому адмиралтейскому типу зданий.";

        public string general_house =
            " Генеральский дом – это казенная усадьба, характерная для уральских городов-заводов. Называется он так потому что предназначался только для проживания семьи начальника оружейного завода. " +
            "Дом выполнен в традициях дворянской классической архитектуры, отличительной чертой которого является трехчастный фасад состоящий из дома и двух флигелей. " +
            "Особенностью этой постройки также являлся Генеральский сад. Он был личным, гулять по нему могли только обитатели дома и их гости. " +
            "А самым необычным считается балкон, которого изначально не было в плане постройки (вероятно пристроен он был уже позднее). Он выполнен из чугуна и его орнамент не имеет аналогов среди подобного литья.";

        public string izhmash =
            " В 1934 году стараниями будущего директора завода А. И. Быховского музей был переведён в здание денежной кладовой, " +
            "в 1941 году в связи с войной покинул его, и в 1975 году, благодаря директору завода И. Ф. Белобородову, вновь вернулся в три отреставрированных зала здания денежной кладовой. " +
            "В 2007 году после реконструкции в музее появился четвёртый зал. Директор музея — Алексей Алексеевич Азовский";

        public string column =
            " Михайловская колонна была установлена в Ижевске на Базарной площади (позднее стала называться Соборной) и открыта 8 ноября в 1852 г. " +
            "по повелению императора Николая I. Она была поставлена в честь великого князя Михаила Павловича, скончавшегося тремя годами ранее в 1849 г. " +
            "Михаил Павлович являлся августейшим начальником военной промышленности Российской Империи в целом и шефом Ижевского оружейного завода в частности.";
    }
}
